oauth2/images/simple_auth.puml
@startuml
You -> BankOfAmerica: my username/password
BankOfAmerica --> You: your transactions
@enduml
