oauth2/index.md
```mermaid
sequenceDiagram
    participant You
    participant BankOfAmerica
    You->>BankOfAmerica: my username/password
    BankOfAmerica-->>You: your transactions
```
