oauth2/images/simple_auth2.puml
@startuml
User -> ResourceOwner: credentials
ResourceOwner --> User: transactions
@enduml
