oauth2/images/mint_first_version.puml
@startuml
You -> Mint: credentials
Mint -> BankOfAmerica: credentials
rnote over BankOfAmerica
  check credentials
endrnote
BankOfAmerica --> Mint: transactions
Mint --> You: transactions
@enduml
