oauth2/images/mint_first_version_abstracted.puml
@startuml
User -> Client: credentials
Client -> ResourceOwner: credentials
rnote over ResourceOwner
  check credentials
endrnote
ResourceOwner --> Client: data
Client --> User: data
@enduml
