oauth2/index.md
```mermaid
sequenceDiagram
    participant You
    participant Mint
    participant AuthorizationServerBoA
    participant BankOfAmerica

    You->>Mint: show my transactions
    Mint-->>You: I can't. I'll redirect you
    You->>AuthorizationServerBoA: give mint access to my transactions
    AuthorizationServerBoA-->>You: give me your credentials
    You->>AuthorizationServerBoA: credentials
    AuthorizationServerBoA-->>You: OK. redirecting you to mint with an access token
    You->>Mint: show transactions given the access token
    Mint->>BankOfAmerica: here's the access token. give me data
    BankOfAmerica-->>Mint: transactions
    Mint-->>You: transactions
```
