oauth2/index.md
```mermaid
sequenceDiagram
    participant User
    participant Client
    participant AuthorizationServer
    participant ResourceOwner

    User->>Client: get data
    Client-->>User: I can't. I'll redirect you
    User->>AuthorizationServer: I want to give Client access to data
    AuthorizationServer-->>User: give me your credentials
    User->>AuthorizationServer: credentials
    AuthorizationServer-->>User: OK. redirecting you to Client with an access token
    User->>Client: get data with access token
    Client->>ResourceOwner: get data with access token
    ResourceOwner-->>Client: data
    Client-->>User: data
```
