oauth2/index.md
```mermaid
sequenceDiagram
    participant You
    participant AuthorizationServerBoA
    participant Mint

    You->>AuthorizationServerBoA: credentials
    AuthorizationServerBoA-->>You: OK. redirecting you to mint with an access token
    You->>Mint: show transactions given my access token
```
